IDS_SRC_EXCEL_CREATE                          = "Creating the Excel data(s)"
IDS_SRC_EXCEL_CANCEL                          = "Export to Excel is canceled."
IDS_SRC_EXCEL_FAIL                            = "Export Failed. Cannot find the EXCEL.EXE"
IDS_SRC_WORD_FAIL                             = "Export Failed. Cannot find the WORD.EXE"

IDS_SRC_MSG_FOLLOW_MEMB_NOT_DESIGN            = "Following members cannot be designed.\n\n"
IDS_SRC_MSG_FOLLOW_MEMB_NOT_CHECK             = "Following members cannot be checked.\n\n"
IDS_SRC_MSG_DESIGN_SRC_COMP_BEAM__d_d         = "Designing SRC Composite Beam. (%d/%d)"
IDS_SRC_MSG_DESIGN_SRC_COLUMN__d_d            = "Designing SRC Column. (%d/%d)"
IDS_SRC_MSG_DESIGN_SRC_CFT_COLUMN__d_d        = "Designing SRC CFT Column. (%d/%d)"
IDS_SRC_TOOLTIP_BUCKLING_LENGTH_FACTOR        = "Effective length factor\nEnter the factor directly or select the desired condition using the right button."
IDS_SRC_MSG_CANNOT_CREATE_CALC_RESULT__s      = "Cannot generate the calculation results of %s."
IDS_SRC_MSG_DONOT_CREATE_REPORT__s            = "Report generation for %s has been failed."
IDS_SRC_MSG_DONOT_CREATE_REPORT               = "Report generation has been failed."
IDS_SRC_MSG_DONOT_CREATE_RESULT_CONTINUE__s   = "Cannot generate the calculation results of %s.\nDo you wish to continue?"
IDS_SRC_MSG_CHECK_SRC_COMPO_BEAM              = "Checking SRC Composite Beam ..."
IDS_SRC_MSG_DESIGN_SRC_COMPO_BEAM             = "Design SRC Composite Beam ..."
IDS_SRC_MSG_CHECK_SRC_COLUMN                  = "Checking SRC Column ..."
IDS_SRC_MSG_DESIGN_SRC_COLUMN                 = "Design SRC Column ..."
IDS_SRC_MSG_CHECK_SRC_CFT_COLUMN              = "Checking SRC CFT Column ..."
IDS_SRC_MSG_DESIGN_SRC_CFT_COLUMN             = "Design SRC CFT Column ..."
IDS_SRC_MSG_LOAD_COMBINATION__i               = "Load Combinations (%i) ..."
IDS_SRC_MSG_LOAD_COMBINATION                  = "Load Combinations ..."

IDS_SRC_NAME_SECTION_1                        = "Section-1"
IDS_SRC_NAME_SECTION_2                        = "Section-2"
IDS_SRC_NAME_SECTION_3                        = "Section-3"
IDS_SRC_NAME_DIAMETER                         = "Diameter"
IDS_SRC_NAME_WIDTH                            = "Width"
IDS_SRC_NAME_PLASTIC                          = "Plastic"
IDS_SRC_NAME_ELASTIC                          = "Elastic"
IDS_SRC_NAME_COMPACT                          = "Compact"
IDS_SRC_NAME_SLENDER                          = "Slender"
IDS_SRC_NAME_NON_COMPACT                      = "Non-compact"
IDS_SRC_NAME_GREEK_LAMDA                      = "λ"

IDS_SRC_TB_NAME_CHECK_ITEM                    = "Check Item"
IDS_SRC_TB_NAME_RESULT                        = "Result"
IDS_SRC_TB_NAME_REMARK                        = "Remark"
IDS_SRC_TB_NAME_VALUE                         = "Value"
IDS_SRC_TB_NAME_CRITERIA                      = "Criteria"

IDS_SRC_TB_NAME_WIDTH_THICKNESS_RATIO         = "Width-Thickness Ratio"
IDS_SRC_TB_NAME_H_PER_TW                      = "h/tw"
IDS_SRC_TB_NAME_DESIGN_METHOD                 = "Design Method"
IDS_SRC_TB_NAME_CONSTRUCTION_STAGE            = "Construction Stage"
IDS_SRC_TB_NAME_LPHI_MN_E                     = "øMn "
IDS_SRC_TB_NAME_MU_PER_LPHI_MN                = "Mu/øMn"
IDS_SRC_TB_NAME_LPHI_VN_E                     = "øVn "
IDS_SRC_TB_NAME_VU_PER_LPHI_VN                = "Vu/øVn"
IDS_SRC_TB_NAME_DELTA_DL_E                    = "δDL "
IDS_SRC_TB_NAME_DELTA_LL_E                    = "δLL "
IDS_SRC_TB_NAME_DELTA_ALL_E                   = "δALL "
IDS_SRC_TB_NAME_STRENGTH_OF_STUD              = "Strength of Stud"
IDS_SRC_TB_NAME_STRENGTH_OF_CHANNEL           = "Strength of Channel"
IDS_SRC_TB_NAME_STRENGTH_OF_SHEAR_CON         = "Strength of Shear Connector"
IDS_SRC_TB_NAME_QN_E                          = "Qn "
IDS_SRC_TB_NAME_V_PRIME_E                     = "V' "
IDS_SRC_TB_NAME_V_PRIME                       = "V'"
IDS_SRC_TB_NAME_Vr_PRIME                      = "Vr'"
IDS_SRC_TB_NAME_SERVICE_STAGE                 = "Service Stage"
IDS_SRC_TB_NAME_VIBRATION                     = "Vibration"
IDS_SRC_TB_NAME_FREQUEMCY_HZ                  = "Frequency (Hz)"
IDS_SRC_TB_NAME_ACCELERATION_PERC             = "Acceleration (%)"
IDS_SRC_TB_NAME_LPHI_EQ__s                    = "ø = %s"
IDS_SRC_TB_NAME_LPHI_EQ2__s                   = "ø=%s"
IDS_SRC_TB_NAME_LPHI_EQ__s1                   = "γ = %s"
IDS_SRC_TB_NAME_LPHI_EQ2__s1                  = "γ=%s"
IDS_SRC_TB_NAME_MU_EQ__s                      = "Mu = %s"
IDS_SRC_TB_NAME_VU_EQ__s                      = "Vu = %s"
IDS_SRC_TB_NAME_SPAN__s_s                     = "%s (Span/%s)"
IDS_SRC_TB_NAME_STUD_NO__d                    = "Stud No. = %d"
IDS_SRC_TB_NAME_CHANNEL_NO__d                 = "Channel No. = %d"
IDS_SRC_TB_NAME_SIGMA_QN_V_PRIME__s           = "ΣQn/V' = %s%%"
IDS_SRC_TB_NAME_PLASTIC_DESIGN                = "Plastic Design"
IDS_SRC_TB_NAME_ELASTIC_DESIGN                = "Elastic Design"
IDS_SRC_TB_NAME_CHK                           = "CHK"
IDS_SRC_TB_NAME_MEMBER_RN_NAME                = "Member\nName"
IDS_SRC_TB_NAME_APPLY_RN_MEMBER_TO            = "Apply\nMember To"
IDS_SRC_TB_NAME_MATERIAL                      = "Material"
IDS_SRC_TB_NAME_STEEL                         = "Steel"
IDS_SRC_TB_NAME_SECTION                       = "Section"
IDS_SRC_TB_NAME_CLASS                         = "Class"
IDS_SRC_TB_NAME_SHAPE                         = "Shape"
IDS_SRC_TB_NAME_FCK                           = "Fck"
IDS_SRC_TB_NAME_FY                            = "Fy"
IDS_SRC_TB_NAME_FYS                           = "Fys"
IDS_SRC_TB_NAME_USE_RN_DB                     = "Use\nDB"

IDS_SRC_TB_NAME_LPHI_MN_E1                    = "MRd "
IDS_SRC_TB_NAME_MU_PER_LPHI_MN1               = "MEd/MRd"
IDS_SRC_TB_NAME_LPHI_VN_E1                    = "VRd "
IDS_SRC_TB_NAME_VU_PER_LPHI_VN1               = "VEd/VRd"
IDS_SRC_TB_NAME_LPHI_PN1                      = "NRd"
IDS_SRC_TB_NAME_LPHI_MNX1                     = "MRd,x"
IDS_SRC_TB_NAME_LPHI_MNY1                     = "MRd,y"
IDS_SRC_TB_NAME_LPHI_VNX1                     = "VRd,x"
IDS_SRC_TB_NAME_LPHI_VNY1                     = "VRd,y"
IDS_SRC_TB_NAME_LPHI_VIN1                     = "PRd"
IDS_SRC_TB_NAME_LPHI_MN1                      = "MRd"
IDS_SRC_TB_NAME_PU_PER_LPHI_PN1               = "NEd/NRd"
IDS_SRC_TB_NAME_LPHI_VN_CON1                  = "Vc,Rd"
IDS_SRC_TB_NAME_LPHI_VN_STL1                  = "Va,Rd"
IDS_SRC_TB_NAME_LPHI_VN1                      = "VRd"
IDS_SRC_TB_NAME_V_PRIME_PER_LPHI_VIN1         = "TEd/VRd"
IDS_SRC_TB_NAME_SPHI_PN1                      = "NRd"
IDS_SRC_TB_NAME_SPHI_MN1                      = "MRd"
IDS_SRC_TB_NAME_SPHI_MNX1                     = "MRd,x"
IDS_SRC_TB_NAME_SPHI_MNY1                     = "MRd,y"
IDS_SRC_TB_NAME_SPHI_VN1                      = "VRd"
IDS_SRC_TB_NAME_QN_E1                         = "Pb,Rd "
IDS_SRC_TB_NAME_V_PRIME_E1                    = "PRd "
IDS_SRC_TB_NAME_MU_EQ__s1                     = "MEd = %s"
IDS_SRC_TB_NAME_VU_EQ__s1                     = "TEd = %s"

IDS_SRC_TB_NAME_NAME                          = "Name"
IDS_SRC_TB_NAME_SIZE                          = "Size"
IDS_SRC_TB_NAME_SIZE1                         = "Size1"
IDS_SRC_TB_NAME_SIZE2                         = "Size2"
IDS_SRC_TB_NAME_SIZE3                         = "Size3"
IDS_SRC_TB_NAME_SIZE4                         = "Size4"
IDS_SRC_TB_NAME_SIZE5                         = "Size5"
IDS_SRC_TB_NAME_SIZE6                         = "Size6"
IDS_SRC_TB_NAME_DESIGN_FORCE                  = "Design Force"
IDS_SRC_TB_NAME_MOMENT                        = "Moment"
IDS_SRC_TB_NAME_SHEAR                         = "Shear"
IDS_SRC_TB_NAME_PU                            = "Pu"
IDS_SRC_TB_NAME_MX                            = "Mx"
IDS_SRC_TB_NAME_MY                            = "My"
IDS_SRC_TB_NAME_VX                            = "Vx"
IDS_SRC_TB_NAME_VY                            = "Vy"
IDS_SRC_TB_NAME_LX                            = "Lx"
IDS_SRC_TB_NAME_LY                            = "Ly"
IDS_SRC_TB_NAME_KX                            = "Kx"
IDS_SRC_TB_NAME_KY                            = "Ky"
IDS_SRC_TB_NAME_LV                            = "Lv"
IDS_SRC_TB_NAME_MUX                           = "Mux"
IDS_SRC_TB_NAME_MUY                           = "Muy"
IDS_SRC_TB_NAME_VUX                           = "Vux"
IDS_SRC_TB_NAME_VUY                           = "Vuy"
IDS_SRC_TB_NAME_LENGTH_N_FACTOR               = "Length & Factor"
IDS_SRC_TB_NAME_WIDTH                         = "Width"
IDS_SRC_TB_NAME_LENGTH                        = "Length"
IDS_SRC_TB_NAME_FACTOR                        = "Factor"
IDS_SRC_TB_NAME_DISTANCE                      = "Distance"
IDS_SRC_TB_NAME_LOAD_TRANSFER                 = "Load Transfer"
IDS_SRC_TB_NAME_EXTERNAL_RN_FORCE_TO          = "External\nForce to"
IDS_SRC_TB_NAME_MEMBER_RN_EXTENDS_TO          = "Member\nExtends to"
IDS_SRC_TB_NAME_SEISMIC                       = "Seismic Provision"
IDS_SRC_TB_NAME_SEISMIC_DUCTILITY             = "Ductility"
IDS_SRC_TB_NAME_DESIGN_STRENGTH               = "Design Strength"
IDS_SRC_TB_NAME_LPHI_PN                       = "øPn"
IDS_SRC_TB_NAME_LPHI_MNX                      = "øMnx"
IDS_SRC_TB_NAME_LPHI_MNY                      = "øMny"
IDS_SRC_TB_NAME_LPHI_VNX                      = "øVnx"
IDS_SRC_TB_NAME_LPHI_VNY                      = "øVny"
IDS_SRC_TB_NAME_LPHI_VIN                      = "øVin"
IDS_SRC_TB_NAME_VIN                           = "Vin"
IDS_SRC_TB_NAME_LPHI_RN                       = "øRn"
IDS_SRC_TB_NAME_DESIGN_RESULT                 = "Design Result"
IDS_SRC_TB_NAME_P                             = "P"
IDS_SRC_TB_NAME_M                             = "M"
IDS_SRC_TB_NAME_V                             = "V"
IDS_SRC_TB_NAME_COMB_PNT_RN_RATIO             = "Comb.\nRatio"

IDS_SRC_TB_NAME_DIRECTION_X                   = "Direction X"
IDS_SRC_TB_NAME_DIRECTION_Y                   = "Direction Y"
IDS_SRC_TB_NAME_BTR                           = "BTR"
IDS_SRC_TB_NAME_REQ_MATL_CAP                  = "REQUIREMENT FOR MATERIAL"
IDS_SRC_TB_NAME_REQ_MATL_CON_MIN              = "Fck,min"
IDS_SRC_TB_NAME_REQ_MATL_CON_MAX              = "Fck,max"
IDS_SRC_TB_NAME_REQ_MATL_STL_MAX              = "Fy,max"
IDS_SRC_TB_NAME_REQ_MATL_BAR_MAX              = "Fyr,max"
IDS_SRC_TB_NAME_REQ_HOOP_CAP                  = "REQUIREMENT FOR HOOP REBAR"
IDS_SRC_TB_NAME_END                           = "End"
IDS_SRC_TB_NAME_MIDDLE                        = "Middle"
IDS_SRC_TB_NAME_REQ_SECT_AS_MIN               = "As,min"
IDS_SRC_TB_NAME_AXIAL_CAPACITY                = "AXIAL CAPACITY"
IDS_SRC_TB_NAME_MOMENT_CAPACITY               = "MOMENT CAPACITY"
IDS_SRC_TB_NAME_SHEAR_CAPACITY                = "SHEAR CAPACITY"
IDS_SRC_TB_NAME_PU_PER_LPHI_PN                = "Pu/øPn"
IDS_SRC_TB_NAME_LPHI_MN                       = "øMn"
IDS_SRC_TB_NAME_COMBINED_RATIO                = "COMBINED RATIO"
IDS_SRC_TB_NAME_COMRAT                        = "ComRat"
IDS_SRC_TB_NAME_LPHI_VN_CON                   = "øVn,con"
IDS_SRC_TB_NAME_LPHI_VN_STL                   = "øVn,stl"
IDS_SRC_TB_NAME_LPHI_VN                       = "øVn"
IDS_SRC_TB_NAME_V_PRIME_PER_LPHI_VIN          = "V'/øVin"
IDS_SRC_TB_NAME_V_PRIME_PER_LPHI_VIN_15       = "Vr'/øVin"
IDS_SRC_TB_NAME_PR_PER_PC__s                  = "Pr/Pc %s 0.2"
IDS_SRC_TB_NAME_V_PRIME_PER_LPHI_RN           = "Vr'/øRn"

IDS_SRC_TB_NAME_MAIN_BAR                      = "MAIN BAR"
IDS_SRC_TB_NAME_L                             = "L"
IDS_SRC_TB_NAME_NO                            = "No"
IDS_SRC_TB_NAME_ROW                           = "Row"
IDS_SRC_TB_NAME_MAIN                          = "Main"
IDS_SRC_TB_NAME_DC                            = "Dc"
IDS_SRC_TB_NAME_CC                            = "Cc"
IDS_SRC_TB_NAME_L1                            = "L1"
IDS_SRC_TB_NAME_MAX_PNT                       = "Max."
IDS_SRC_TB_NAME_HOOP_BAR                      = "HOOP BAR"
IDS_SRC_TB_NAME_CEN_PNT                       = "Cen."
IDS_SRC_TB_NAME_USER_INPUT                    = "User Input"
IDS_SRC_TB_NAME_CONC                          = "Con'c"
IDS_SRC_TB_NAME_LAYER                         = "Layer"
IDS_SRC_TB_NAME_LAYER_1                       = "Layer 1"
IDS_SRC_TB_NAME_MAX_PNT_NUM                   = "Max.Num"
IDS_SRC_TB_NAME_CENTER                        = "Center"
IDS_SRC_TB_NAME_USE_USER_INPUT                = "Use User Input"

IDS_SRC_TB_NAME_H_BEAM                        = "H-Beam"
IDS_SRC_TB_NAME_STUD                          = "Stud"
IDS_SRC_TB_NAME_SHEARCON                      = "Shear Connector"
IDS_SRC_TB_NAME_SHEAR_N_CONNECTOR             = "Shear\nConnector"
IDS_SRC_TB_NAME_TYPE                          = "Type"
IDS_SRC_TB_NAME_HEIGHT                        = "Height"
IDS_SRC_TB_NAME_FORCE                         = "Force"
IDS_SRC_TB_NAME_SPLICE                        = "Splice"
IDS_SRC_TB_NAME_ROWS                          = "Rows"
IDS_SRC_TB_NAME_ARRANGEMENT                   = "Arrangement"
IDS_SRC_TB_NAME_SPACE                         = "Space"
IDS_SRC_TB_NAME_USE_RN_USER                   = "Use\nUser"
IDS_SRC_TB_NAME_CHECK                         = "Check"
IDS_SRC_TB_NAME_TARGET_RN_MATERIAL            = "Target\nMaterial"
IDS_SRC_TB_NAME_TRANSFER_FORCE                = "Transfer\nForce"
IDS_SRC_TB_NAME_TRANSFER_REGION               = "Transfer\nRegion"
IDS_SRC_TB_NAME_MEMBER_EXTEND                 = "Member\nExtend To"

IDS_SRC_TB_NAME_LCOMB                         = "Load Comb."
IDS_SRC_TB_NAME_LCOMBINATION                  = "Load Combination"
IDS_SRC_TB_NAME_DOTDOTDOT                     = "..."

IDS_SRC_TB_NAME_HEADED_STUD                   = "Headed Stud"
IDS_SRC_TB_NAME_COLUMNS                       = "Columns"
IDS_SRC_TB_NAME_WEB                           = "Web"
IDS_SRC_TB_NAME_FLANGE                        = "Flange"
IDS_SRC_TB_NAME_HEADED_CHANNEL                = "Channel"


IDS_SRC_TB_NAME_SPHI_PN                       = "øPn"
IDS_SRC_TB_NAME_SPHI_MN                       = "øMn"
IDS_SRC_TB_NAME_SPHI_MNX                      = "øMnx"
IDS_SRC_TB_NAME_SPHI_MNY                      = "øMny"
IDS_SRC_TB_NAME_SPHI_VN                       = "øVn"

IDS_SRC_TB_NAME_RHO_SR                        = "ρsr"
IDS_SRC_TB_NAME_RHO_S                         = "ρs"
IDS_SRC_TB_NAME_LPHI                          = "ø"
IDS_SRC_TB_NAME_LPHI1                         = "γ"
IDS_SRC_TB_NAME_LAMBDA_MAX                    = "λmax"

IDS_SRC_TB_NAME_SMAX                          = "smax"
IDS_SRC_TB_NAME_S_PER_SMAX                    = "s/smax"
IDS_SRC_TB_NAME_LPHI_VN_CONC                  = "øVn,con"
IDS_SRC_TB_NAME_LPHI_VN_STEEL                 = "øVn,stl"
IDS_SRC_TB_NAME_LPHI_VN_STL_BAR               = "øVn,stl+bar"

IDS_SRC_TB_NAME_RHO_MAX__s                    = "ρmax=%s%%"
IDS_SRC_TB_NAME_RHO_MIN__s                    = "ρmin=%s%%"
IDS_SRC_TB_NAME_SMALL_RHO_MIN__s              = "<ρmin(%s%%)"
IDS_SRC_TB_NAME_LARGE_RHO_MAX__s              = ">ρmax(%s%%)"
IDS_SRC_TB_NAME_LPHI_EQ_075                   = "ø = 0.75"
IDS_SRC_TB_NAME_LPHI_EQ_090                   = "ø = 0.90"
IDS_SRC_TB_NAME_POS_PNT                       = "Pos."
IDS_SRC_TB_NAME_SELF_RN_LOAD                  = "Self\nLoad"
IDS_SRC_TB_NAME_LIVE_RN_LOAD                  = "Live\nLoad"
IDS_SRC_TB_NAME_FINISH_RN_LOAD                = "Finish\nLoad"
IDS_SRC_TB_NAME_CONST_RN_LOAD                 = "Const.\nLoad"
IDS_SRC_TB_NAME_CONSTRUCTION_RN_LOAD          = "Construction\nLoad"
IDS_SRC_TB_NAME_SLAB_RN_THK_PNT               = "Slab\nTHK."
IDS_SRC_TB_NAME_DECK_PLATE                    = "Deck Plate"
IDS_SRC_TB_NAME_USE                           = "Use"
IDS_SRC_TB_NAME_DIRECTION                     = "Direction"
IDS_SRC_TB_NAME_SPAN_N_SUPPORT                = "Span & Support"
IDS_SRC_TB_NAME_USE_RN_SUPPORT                = "Use\nSupport"
IDS_SRC_TB_NAME_SPAN                          = "Span"
IDS_SRC_TB_NAME_UNBRACED_RN_LENGTH            = "Unbraced\nLength"
IDS_SRC_TB_NAME_DESIGN_LOAD                   = "Design Load"
IDS_SRC_TB_NAME_SELF_DASH_RN_WEIGHT           = "Self-\nWeight"
IDS_SRC_TB_NAME_CONCENTRATED_FORCE            = "Concentrated Force"
IDS_SRC_TB_NAME_DEFLECTION                    = "Deflection"
IDS_SRC_TB_NAME_DURING_RN_CONSTRUCTION        = "During\nConstruction"
IDS_SRC_TB_NAME_BY_LIVE_RN_LOAD               = "by Live\nLoad"
IDS_SRC_TB_NAME_BY_DEAD_RN_N_LIVE_LOAD        = "by Dead\n& Live Load"
IDS_SRC_TB_NAME_LOAD_RN_FACTOR_RN_PERC        = "Load\n Factor\n(%)"
IDS_SRC_TB_NAME_USE_TYPE                      = "Use Type"
IDS_SRC_TB_NAME_DAMP_RN_RATIO_BETA            = "Damp.\nRatio (β)"
IDS_SRC_TB_NAME_BY_RN_FIRDER_RN_MODE          = "By\nGirder\nMode"
IDS_SRC_TB_NAME_GIRDER_RN_SPAN                = "Girder\nSpan"
IDS_SRC_TB_NAME_POS_OF_GIRDER                 = "Pos. of\nGirder"
IDS_SRC_TB_NAME_CONNECTION_RN_TYPE            = "Connection\nType"
IDS_SRC_TB_NAME_GIRDER_RN_SHAPE               = "Girder\nShape"
IDS_SRC_TB_NAME_GIRDER_RN_NAME                = "Girder\nName"
IDS_SRC_TB_NAME_GIRDER_SIZE                   = "Girder Size"
IDS_SRC_TB_NAME_DESIGN_RN_METHOD              = "Design\nMethod"
IDS_SRC_TB_NAME_DELTA_DL                      = "δDL"
IDS_SRC_TB_NAME_DELTA_LL                      = "δLL"
IDS_SRC_TB_NAME_DELTA_ALL                     = "δALL"
IDS_SRC_TB_NAME_QN                            = "Qn"
IDS_SRC_TB_NAME_FREQUEMCY_RN_HZ               = "Frequency\n(Hz)"
IDS_SRC_TB_NAME_ACCELERATION_RN_PERC          = "Accelation\n(%)"

IDS_SRC_TB_NAME_H                             = "H"
IDS_SRC_TB_NAME_BU                            = "Bu"
IDS_SRC_TB_NAME_BL                            = "BL"
IDS_SRC_TB_NAME_HU                            = "Hu"
IDS_SRC_TB_NAME_HL                            = "HL"
IDS_SRC_TB_NAME_TW                            = "Tw"
IDS_SRC_TB_NAME_TU                            = "Tu"
IDS_SRC_TB_NAME_TL                            = "TL"
IDS_SRC_TB_NAME_HR                            = "HR"
IDS_SRC_TB_NAME_BR                            = "BR"
IDS_SRC_TB_NAME_TR                            = "TR"
IDS_SRC_TB_NAME_RC                            = "RC"
IDS_SRC_TB_NAME_SLAB                          = "Slab"
IDS_SRC_TB_NAME_REBAR                         = "Rebar"
IDS_SRC_TB_NAME_COVER                         = "Cover"
IDS_SRC_TB_NAME_LB                            = "Lb"
IDS_SRC_TB_NAME_CONS_PNT                      = "Cons."
IDS_SRC_TB_NAME_SURFACE                       = "Surface"
IDS_SRC_TB_NAME_LIVE                          = "Live"

IDS_SRC_TB_NAME_RESULT_1                      = "Result 1"
IDS_SRC_TB_NAME_RESULT_2                      = "Result 2"
IDS_SRC_TB_NAME_RESULT_3                      = "Result 3"
IDS_SRC_TB_NAME_RESULT_4                      = "Result 4"
IDS_SRC_TB_NAME_RESULT_5                      = "Result 5"

IDS_SRC_TB_NAME_A0                            = "A0"
IDS_SRC_TB_NAME_Y0                            = "Y0"
IDS_SRC_TB_NAME_I0                            = "I0"
IDS_SRC_TB_NAME_ZC0                           = "Zc0"
IDS_SRC_TB_NAME_ZT0                           = "Zt0"
IDS_SRC_TB_NAME_A1                            = "A1"
IDS_SRC_TB_NAME_Y1                            = "Y1"
IDS_SRC_TB_NAME_I1                            = "I1"
IDS_SRC_TB_NAME_ZC1                           = "Zc1"
IDS_SRC_TB_NAME_ZT1                           = "Zt1"
IDS_SRC_TB_NAME_A2                            = "A2"
IDS_SRC_TB_NAME_Y2                            = "Y2"
IDS_SRC_TB_NAME_I2                            = "I2"
IDS_SRC_TB_NAME_ZC2                           = "Zc2"
IDS_SRC_TB_NAME_ZT2                           = "Zt2"
IDS_SRC_TB_NAME_AG                            = "Ag"
IDS_SRC_TB_NAME_YG                            = "Yg"
IDS_SRC_TB_NAME_IG                            = "Ig"
IDS_SRC_TB_NAME_ZCG                           = "Zcg"
IDS_SRC_TB_NAME_ZTG                           = "Ztg"

IDS_SRC_DLG_TITLE_CREATE_REPORT_FILE__s       = "Create Report File( SRC / %s )"
IDS_SRC_MSG_PRINT_QUICK_REPORT__s             = "Print Quick Report( SRC / %s )"
IDS_SRC_MSG_CREATE_EMF_FILES__s               = "Create EMF Files( SRC / %s )"
IDS_SRC_MSG_CREATE_BMP_FILES__s               = "Create BMP Files( SRC / %s )"
IDS_SRC_MSG_CREATE_JPG_FILES__s               = "Create JPG Files( SRC / %s )"
IDS_SRC_TB_NAME_OVER                          = "Over"
IDS_SRC_MSG_CONCEN_FORCE_NOTHING              = "Concentrated Force does not exist."
IDS_SRC_MSG_CONCEN_FORCE_INVALID_ROW_TO_DEL   = "Invalid Row for Delete."
IDS_SRC_MSG_CONCEN_FORCE_INVALID_ROW_TO_INS   = "Invalid Row for Insert."
